In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data = df[['PassengerId','Name']]
data.head()

   PassengerId                                               Name
0            1                            Braund, Mr. Owen Harris
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3                             Heikkinen, Miss. Laina
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5                           Allen, Mr. William Henry

## ReGen

In [6]:
data['Title'] = data['Name'].map(lambda x: re.compile(", (.*?)\.").findall(x)[0])
data.head()

/Users/FY/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   PassengerId                                               Name Title
0            1                            Braund, Mr. Owen Harris    Mr
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs
2            3                             Heikkinen, Miss. Laina  Miss
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs
4            5                           Allen, Mr. William Henry    Mr

## Change value by dictionary

In [7]:
data.Title.value_counts()

Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Col               2
Mlle              2
Major             2
Lady              1
Don               1
the Countess      1
Ms                1
Mme               1
Sir               1
Jonkheer          1
Capt              1
Name: Title, dtype: int64

In [9]:
title_dict={}
title_dict.update(dict.fromkeys(['Capt','Col','Major','Dr','Rev'],'Officer'))
title_dict.update(dict.fromkeys(['Don','Sir','the Countless','Dona','Lady'],'Royalty'))
title_dict.update(dict.fromkeys(['Mlle','Miss'],'Miss'))
title_dict.update(dict.fromkeys(['Master','Jonkheer'],'Master'))
title_dict

{'Capt': 'Officer',
 'Col': 'Officer',
 'Major': 'Officer',
 'Dr': 'Officer',
 'Rev': 'Officer',
 'Don': 'Royalty',
 'Sir': 'Royalty',
 'the Countless': 'Royalty',
 'Dona': 'Royalty',
 'Lady': 'Royalty',
 'Mlle': 'Miss',
 'Miss': 'Miss',
 'Master': 'Master',
 'Jonkheer': 'Master'}

In [11]:
data['Title']=data['Title'].map(title_dict)
data.Title.value_counts()

/Users/FY/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Miss       184
Master      41
Officer     18
Royalty      3
Name: Title, dtype: int64

## One-hot encoding

In [12]:
dummies_title = pd.get_dummies(data['Title'],prefix='Title')
data=pd.concat([data,dummies_title],axis=1)
data.head()

,PassengerId,Name,Title,Title_Master,Title_Miss,Title_Officer,Title_Royalty
0,1,"Braund, Mr. Owen Harris",NaN,0,0,0,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,0,0,0,0
2,3,"Heikkinen, Miss. Laina",Miss,0,1,0,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,0,0,0,0
4,5,"Allen, Mr. William Henry",NaN,0,0,0,0